var postList = [
  {
    title: "一部独特的穿越日剧《仁医》",
    content: "《仁医》讲述的是现代脑外科医生南方仁通过穿越时空回到了幕末时期，在救治病人的过程中遇到当时的不同英雄人物，并渐渐地被卷入了激荡的历史大潮之中的故事...",
    imgSrc: "/images/background/renyi-1.png",
    reading: 102,
    detail: "《仁医》讲述的是现代脑外科医生南方仁（大泽隆夫饰）通过穿越时空回到了幕末时期，在救治病人的过程中遇到当时的不同英雄人物，并渐渐地被卷入了激荡的历史大潮之中的故事。仁医算是穿越剧，因而也可以说是我看到的最优秀的穿越剧，因为他不是在古代泡妹、升官发财，而是在利用自己医术拯救别人的同时完成了自身的成长。这部剧融合了历史、医学、科幻、穿越等很多方面内容在里面，故事天马行空的同时又十分具有真实感。南方仁大夫依靠自己的医术在古代完成一次又一次不可能的手术，拯救了许多濒临死亡的病人。但是当他发现那些被他拯救的病人总会以其它方式死去的时候，他陷入了迷茫，发现在历史的洪流面前自己犹如砂砾……在一次又一次的抉择与反思过程中，南方仁最终成长为一个心怀天下的仁者侠医。这部剧不仅仅是因为它无时无刻都在给你正能量的东西，还在于它里面的每一个人物都有血有肉，都有自己的成长轨迹，让你觉得你和他们在一起成长。上帝只会给人能挺过去的考验，未来的光明是靠现在的人们用双手创造出来的。这是剧中最经典的一句台词，我在此献给每个在不断努力的人们。也希望这部好剧能给你们带来感动与成长……",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/lpl.png",
    author: "猫是猫的猫",
    date: "Nov 20 2020",
    avatar: "/images/avatar/5.png",
    postId: 0,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=1372060183.mp3",
        title: "空-徐海俏",
        coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000",
    }
},

    {
        date: "Sep 18 2020",
        title: "正是虾肥蟹壮时",
        imgSrc: "/images/post/crab.png",
        avatar: "/images/avatar/1.png",
        content: "菊黄蟹正肥，品尝秋之味。徐志摩把,“看初花的荻芦”和“到楼外楼吃蟹”,并列为秋天来杭州不能错过的风雅之事；用林妹妹的话讲是“螯封嫩玉双双满，",
        reading: "112",
        collection: "96",
        headImgSrc: "/images/post/crab.png",
        author: "林白衣",
        dateTime: "24小时前",
        detail: "菊黄蟹正肥，品尝秋之味。徐志摩把“看初花的荻芦”和“到楼外楼吃蟹”并列为秋天来杭州不能错过的风雅之事；用林妹妹的话讲是“螯封嫩玉双双满，壳凸红脂块块香”；在《世说新语》里，晋毕卓更是感叹“右手持酒杯，左手持蟹螯，拍浮酒船中，便足了一生矣。”漫漫人生长路，美食与爱岂可辜负？于是作为一个吃货，突然也很想回味一下属于我的味蕾记忆。记忆中的秋蟹，是家人的味道，弥漫着浓浓的亲情。\n\n是谁来自山川湖海，却囿于昼夜，厨房与爱？ 是母亲，深思熟虑，聪明耐心。吃蟹前，总会拿出几件工具，煞有介事而乐此不疲。告诉我们螃蟹至寒，需要佐以姜茶以祛寒，在配备的米醋小碟里，亦添入姜丝与紫苏，前者驱寒后者增香。泡好菊花茶，岁月静好，我们静等。",
        postId: 1,
        music: {
          url: "http://music.163.com/song/media/outer/url?id=1386866050.mp3",
            title: "笑看风云",
            coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000"
        }
    },
    {
        //按住alt + shift + F 可以格式化代码样式
        title: "当我们在谈论经济学时，我们在谈论什么?",
        content: "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
        detail: "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——",
        imgSrc: "/images/post/sls.jpg",
        headImgSrc: "/images/post/sls.jpg",
        reading: 62,
        collection: 92,
        author: "知乎",
        date: "Nov 12 2020",
        dateTime: "三天前",
        avatar: "/images/avatar/3.png",
        postId: 2,
        music: {
          url: "http://music.163.com/song/media/outer/url?id=30031580.mp3",
            title: "原来你也在这里-秦昊",
            coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000"
        }
    },
   {
        title: "唯美悲伤纯爱的故事《只有我是十七岁的世界》",
        imgSrc: "/images/background/onlyme17-3.jpg",
        content: "该剧讲述的是17岁就去世的染谷航太和成长为24岁的今野芽衣之间展开的故事。航太没有告诉人们自己的想法就离开了这个世界。时隔7年，回到故乡的芽衣，在樱花反季节盛开的树下遇到了航太...",
        detail: "今野芽衣，17岁，活泼可爱人缘好，享受青春，志愿一辈子在自己热爱的故乡生活。今野芽衣，24岁，沉静内敛，在东京的出版社做着派遣职员，却因为和摄影师的不伦恋情，被原配当众打了一耳光后，灰溜溜地辞职。回到自己的小公寓，卸妆，将头发绑成丸子头，索然无味地吃着杯面看电视。n忽然，手机提示，马上就是染谷航太的生日了。就在同时，电视上的新闻告诉她，故乡的樱花反季节盛开。于是，在离开故乡7年后，她决定回去，看看樱花！成年后时常自问，也偶尔被问：“你有长成自己期盼的样子吗？”“18岁的你会怎么看待现在的自己呢？” 青春期时幻想过自己成年后的各种可能，真的长大了才发现，哪怕是想变成曾经瞧不上的那份庸碌平淡，也是那么的艰难。曾自以为必不会浑浑噩噩按部就班的生活，工作。以为就算没有什么激情澎湃，百转千回的经历，至少也不会像那些“无趣”的大人们一般，庸庸碌碌...直到现实将你拍醒！发现自己不是独一无二，承认自己的平凡，是长大后最悲伤的事儿。前些时候，看过一个视频——《欢迎来到成年人的世界》，也不知道为什么，就看哭了，即便没有相同的经历，作为成年人，也会自然共情。无论是那个在夜晚的公交车上独自吃着生日蛋糕的成年人，还是曾经看过的另一个视频里，晚班电车里吃着包子哭泣的成年人，成年人最能明白成年人的艰难。于是越是成年，越爱看青春片。青春片是刚接触日剧的时候，最喜欢的类型。那里面有春天的樱花和入学式，夏季的甲子园和花火大会，秋天里加厚外套的制服，还有冬日的被炉，初詣以及入学考试。同样的更迭里，有帮助“野猪”改造的他们，有想向心上人讨要第二粒钮扣却开不了口的她们，有被热血老师改造的不良少年，也有对未来充满希冀却被病魔击倒的少女...于是，我记住了樱花树上的少年，记住了与各种交通工具赛跑的他和她，记住了可能与剧情无关，却深深烙印在心头的台词，或悲或喜...之所以会对这部Abema的自制剧产生兴趣，纯粹是因为剧名——《只有我还是17岁的世界》。无论是《一公升眼泪》里的亚也，还是《人间・失格》里永远停留在15岁的大场诚，又或是《未闻花名》里的芽衣子，越是青春弱小生命的逝去，越叫人不甘和惋惜。因为即便这个世界不是绝对美好，却也有太多太多值得你去期待去感受的，戛然而止的生命永远叫人遗憾。17岁的芽衣和航太是恋人未满，男孩想水到渠成，女孩想要仪式感，结果确是还来不及说爱你就永别，还来不及表达就终结",
        collection: 26,
        dateTime: "24小时前",
        headImgSrc: "/images/bestplayers.png",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "/images/avatar/3.png",
        postId: 3,
        music: {
          url: "http://music.163.com/song/media/outer/url?id=1334295185.mp3",
            title: "写给黄淮-邵帅",
            coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000"
        }
    },
    {
        title: "飞驰的人生",
        content: "《飞驰人生》应该是韩寒三部曲的第三部。从《后悔无期》到《乘风破浪》再到《飞驰人生》",
        imgSrc: "/images/jumpfly.png",
        reading: 96,
        detail: "《飞驰人生》应该是韩寒三部曲的第三部。从《后悔无期》到《乘风破浪》再到《飞驰人生》，故事是越讲越直白，也越来越贴近大众。关于理想、关于青春永远是韩寒作品的主题。也许生活确实像白开水，需要一些假设的梦想，即使大多数人都不曾为梦想努力过，但我们依然爱看其他人追梦，来给自己带来些许的慰藉。",
        collection: 26,
        dateTime: "21小时前",
        headImgSrc: "/images/jumpfly.png",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "/images/avatar/5.png",
        postId: 4,
        music: {
          url: "http://music.163.com/song/media/outer/url?id=1344368486.mp3",
            title: "奉献-韩寒",
            coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000"
        }
    },
]

export {
  postList
}

// module.exports = {
//   postList:local_database
// }

// javascript 模块
// this.setData
// 导入 导出
// JS 模块导入导出